---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisUtilitiesDBFailures.AimErrEmptyName
source: html/e43f860d-06b5-0bc0-1cef-2513f276d224.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisUtilitiesDBFailures.AimErrEmptyName Property

MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers.

## Syntax (C#)
```csharp
public static FailureDefinitionId AimErrEmptyName { get; }
```